---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtEnd
source: html/349df1c3-2f2d-8671-4547-d2c5592d707f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtEnd Property

"Parallel Treads at End": Number of straight steps at the begin of winder

## Syntax (C#)
```csharp
public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtEnd { get; }
```